<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"01e92c07b1043e90b7f71c30af8a3f9b77a059a79a9a667a38f7f89443e152e5","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1386 at https://github.com/cal-itp/data-infra/actions/runs/21424102462","plan_out_hash":"9a8bf537ebd2a16787257b7f6725c9b96f679b75e64da1f31be76f07fc75ba9a","plan_hash":"d7796f0c736e5a5e80043ffc9afa897d3c20dba396daa5975de3236642fc9a55","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 8 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "xPDLGw==" -> (known after apply)
!~      detect_md5hash      = "FKSUwC+t3q2jKSkl9TCQcw==" -> "different hash"
!~      generation          = 1768514560606945 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_all_dag.py"
!~      md5hash             = "FKSUwC+t3q2jKSkl9TCQcw==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "Z0w6hQ==" -> (known after apply)
!~      detect_md5hash      = "DVOSH2oU/qskASy9ZTl8bg==" -> "different hash"
!~      generation          = 1768421223190412 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "DVOSH2oU/qskASy9ZTl8bg==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "88bjbw==" -> (known after apply)
!~      detect_md5hash      = "K8KpKd0QgIi+7tHQkcmuDw==" -> "different hash"
!~      generation          = 1768514560639582 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "K8KpKd0QgIi+7tHQkcmuDw==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "p0998g==" -> (known after apply)
!~      detect_md5hash      = "8cOOfE1GOFE9wJWXmAIw2w==" -> "different hash"
!~      generation          = 1768448714758268 -> (known after apply)
        id                  = "calitp-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "8cOOfE1GOFE9wJWXmAIw2w==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/parse_and_validate_rt.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "wpI++w==" -> (known after apply)
!~      detect_md5hash      = "pNPzpyXXhJ7nE2gonrrj9A==" -> "different hash"
!~      generation          = 1757960021181964 -> (known after apply)
        id                  = "calitp-composer-dags/parse_and_validate_rt.py"
!~      md5hash             = "pNPzpyXXhJ7nE2gonrrj9A==" -> (known after apply)
        name                = "dags/parse_and_validate_rt.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/publish_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "1wVUUg==" -> (known after apply)
!~      detect_md5hash      = "+nBTrnLGt3kJTaFeFB0L6A==" -> "different hash"
!~      generation          = 1762463102726202 -> (known after apply)
        id                  = "calitp-composer-dags/publish_gtfs.py"
!~      md5hash             = "+nBTrnLGt3kJTaFeFB0L6A==" -> (known after apply)
        name                = "dags/publish_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "zWR/bA==" -> (known after apply)
!~      detect_md5hash      = "NT8+8pUpzEVihAuR6ohOnw==" -> "different hash"
!~      generation          = 1769557849138495 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "NT8+8pUpzEVihAuR6ohOnw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "pOlCXw==" -> (known after apply)
!~      detect_md5hash      = "VHwWtQE5r7IlHWCWlSr7Hw==" -> "different hash"
!~      generation          = 1769557850676940 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "VHwWtQE5r7IlHWCWlSr7Hw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1386](https://github.com/cal-itp/data-infra/actions/runs/21424102462)